Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_stats.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_stats.c
 *    Mcxnex IB Performance Statistics routines
 *
 *    Implements all the routines necessary for setting up, querying, and
 *    (later) tearing down all the kstats necessary for implementing to
 *    the interfaces necessary to provide busstat(1M) access.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>

#include "mcxnex.h"

static kstat_t *mcxnex_kstat_picN_create(mcxnex_state_t *state, int num_pic,
    int num_evt, mcxnex_ks_mask_t *ev_array);
static kstat_t *mcxnex_kstat_cntr_create(mcxnex_state_t *state, int num_pic,
    int (*update)(kstat_t *, int));
static int mcxnex_kstat_cntr_update(kstat_t *ksp, int rw);

void mcxnex_kstat_perfcntr64_create(mcxnex_state_t *state, uint_t port_num);
static int mcxnex_kstat_perfcntr64_read(mcxnex_state_t *state, uint_t port,
    int reset);
static void mcxnex_kstat_perfcntr64_thread_exit(mcxnex_ks_info_t *ksi);
static int mcxnex_kstat_perfcntr64_update(kstat_t *ksp, int rw);

/*
 * Mcxnex IB Performance Events structure
 *    This structure is read-only and is used to setup the individual kstats
 *    and to initialize the tki_ib_perfcnt[] array for each Mcxnex instance.
 */
mcxnex_ks_mask_t mcxnex_ib_perfcnt_list[MCXNEX_CNTR_NUMENTRIES] = {
	{"port_xmit_data", 0, 0},
	{"port_recv_data", 0, 0},
	{"port_xmit_pkts", 0, 0},
	{"port_recv_pkts", 0, 0},
	{"port_recv_err", 0, 0},
	{"port_xmit_discards", 0, 0},
	{"vl15_dropped", 0, 0},
	{"port_xmit_wait", 0, 0},
	{"port_recv_remote_phys_err", 0, 0},
	{"port_xmit_constraint_err", 0, 0},
	{"port_recv_constraint_err", 0, 0},
	{"symbol_err_counter", 0, 0},
	{"link_err_recovery_cnt", 0, 0},
	{"link_downed_cnt", 0, 0},
	{"excessive_buffer_overruns", 0, 0},
	{"local_link_integrity_err", 0, 0},
	{"clear_pic", 0, 0}
};

/*
 * Return the maximum of (x) and (y)
 */
#define	MAX(x, y)	(((x) > (y)) ? (x) : (y))

/*
 * Set (x) to the maximum of (x) and (y)
 */
#define	SET_TO_MAX(x, y)	\
{				\
	if ((x) < (y))		\
		(x) = (y);	\
}

/*
 * mcxnex_kstat_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_kstat_init(mcxnex_state_t *state)
{
	mcxnex_ks_info_t		*ksi;
	uint_t			numports;
	int			i;

	/* Allocate a kstat info structure */
	ksi = (mcxnex_ks_info_t *)kmem_zalloc(sizeof (mcxnex_ks_info_t),
	    KM_SLEEP);
	if (ksi == NULL) {
		return (DDI_FAILURE);
	}
	state->hs_ks_info = ksi;

	/*
	 * Create as many "pic" and perfcntr64 kstats as we have IB ports.
	 * Enable all of the events specified in the "mcxnex_ib_perfcnt_list"
	 * structure.
	 */
	numports = state->hs_cfg_profile->cp_num_ports;
	for (i = 0; i < numports; i++) {
		ksi->hki_picN_ksp[i] = mcxnex_kstat_picN_create(state, i,
		    MCXNEX_CNTR_NUMENTRIES, mcxnex_ib_perfcnt_list);
		if (ksi->hki_picN_ksp[i] == NULL) {
			goto kstat_init_fail;
		}

		mcxnex_kstat_perfcntr64_create(state, i + 1);
		if (ksi->hki_perfcntr64[i].hki64_ksp == NULL) {
			goto kstat_init_fail;
		}
	}

	/* Create the "counters" kstat too */
	ksi->hki_cntr_ksp = mcxnex_kstat_cntr_create(state, numports,
	    mcxnex_kstat_cntr_update);
	if (ksi->hki_cntr_ksp == NULL) {
		goto kstat_init_fail;
	}

	/* Initialize the control register and initial counter values */
	ksi->hki_pcr  = 0;
	ksi->hki_pic0 = 0;
	ksi->hki_pic1 = 0;

	/*
	 * Initialize the Mcxnex hki_ib_perfcnt[] array values using the
	 * default values in mcxnex_ib_perfcnt_list[]
	 */
	for (i = 0; i < MCXNEX_CNTR_NUMENTRIES; i++) {
		ksi->hki_ib_perfcnt[i] = mcxnex_ib_perfcnt_list[i];
	}

	mutex_init(&ksi->hki_perfcntr64_lock, NULL, MUTEX_DRIVER, NULL);
	cv_init(&ksi->hki_perfcntr64_cv, NULL, CV_DRIVER, NULL);

	return (DDI_SUCCESS);


kstat_init_fail:

	/* Delete all the previously created kstats */
	if (ksi->hki_cntr_ksp != NULL) {
		kstat_delete(ksi->hki_cntr_ksp);
	}
	for (i = 0; i < numports; i++) {
		if (ksi->hki_picN_ksp[i] != NULL) {
			kstat_delete(ksi->hki_picN_ksp[i]);
		}
		if (ksi->hki_perfcntr64[i].hki64_ksp != NULL) {
			kstat_delete(ksi->hki_perfcntr64[i].hki64_ksp);
		}
	}

	/* Free the kstat info structure */
	kmem_free(ksi, sizeof (mcxnex_ks_info_t));

	return (DDI_FAILURE);
}


/*
 * mcxnex_kstat_init()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_kstat_fini(mcxnex_state_t *state)
{
	mcxnex_ks_info_t	*ksi;
	uint_t			numports;
	int			i;

	/* Get pointer to kstat info */
	ksi = state->hs_ks_info;

	/*
	 * Signal the perfcntr64_update_thread to exit and wait until the
	 * thread exits.
	 */
	mutex_enter(&ksi->hki_perfcntr64_lock);
	mcxnex_kstat_perfcntr64_thread_exit(ksi);
	mutex_exit(&ksi->hki_perfcntr64_lock);

	/* Delete all the "pic" and perfcntr64 kstats (one per port) */
	numports = state->hs_cfg_profile->cp_num_ports;
	for (i = 0; i < numports; i++) {
		if (ksi->hki_picN_ksp[i] != NULL) {
			kstat_delete(ksi->hki_picN_ksp[i]);
		}

		if (ksi->hki_perfcntr64[i].hki64_ksp != NULL) {
			kstat_delete(ksi->hki_perfcntr64[i].hki64_ksp);
		}
	}

	/* Delete the "counter" kstats (one per port) */
	kstat_delete(ksi->hki_cntr_ksp);

	cv_destroy(&ksi->hki_perfcntr64_cv);
	mutex_destroy(&ksi->hki_perfcntr64_lock);

