Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_stats.c
		/*
		 * If necessary, fill in the "pic1" counter for port 2.
		 * This works the same as above except that we extract the
		 * upper bits (corresponding to the counters for "pic1")
		 */
		if (numports == MCXNEX_MAX_PORTS) {
			indx   = pcr >> MCXNEX_CNTR_SIZE;
			oldval = ib_perf[indx].ks_old_pic1;

			status = mcxnex_getperfcntr_cmd_post(state, 2,
			    DDI_NOSLEEP, &sm_perfcntr, 0);
			if (status != MCXNEX_CMD_SUCCESS) {
				return (-1);
			}
			switch (indx) {
			case 0:		/* port_xmit_data */
				tmp = sm_perfcntr.portxmdata;
				break;
			case 1:		/* port_recv_data */
				tmp = sm_perfcntr.portrcdata;
				break;
			case 2:		/* port_xmit_pkts */
				tmp = sm_perfcntr.portxmpkts;
				break;
			case 3:		/* port_recv_pkts */
				tmp = sm_perfcntr.portrcpkts;
				break;
			case 4:		/* port_recv_err */
				tmp = sm_perfcntr.portrcv;
				break;
			case 5:		/* port_xmit_discards */
				tmp = sm_perfcntr.portxmdiscard;
				break;
			case 6:		/* vl15_dropped */
				tmp = sm_perfcntr.vl15drop;
				break;
			case 7:		/* port_xmit_wait */
				tmp = sm_perfcntr.portxmwait;
				break;
			case 8:		/* port_recv_remote_phys_err */
				tmp = sm_perfcntr.portrcvrem;
				break;
			case 9:		/* port_xmit_constraint_err */
				tmp = sm_perfcntr.portxmconstr;
				break;
			case 10:	/* port_recv_constraint_err */
				tmp = sm_perfcntr.portrcconstr;
				break;
			case 11:	/* symbol_err_counter */
				tmp = sm_perfcntr.symerr;
				break;
			case 12:	/* link_err_recovery_cnt */
				tmp = sm_perfcntr.linkerrrec;
				break;
			case 13:	/* link_downed_cnt */
				tmp = sm_perfcntr.linkdown;
				break;
			case 14:	/* excessive_buffer_overruns */
				tmp = sm_perfcntr.xsbuffovrun;
				break;
			case 15:	/* local_link_integrity_err */
				tmp = sm_perfcntr.locallinkint;
				break;
			case 16:	/* clear_pic */
				tmp = 0;	/* XXX */
				break;
			default:
				cmn_err(CE_CONT, "perf counter out of range\n");
			}

			ib_perf[indx].ks_old_pic1 = tmp;

			tmp = tmp - oldval;
			ksi->hki_pic1 += tmp;
			data[2].value.ui64 = ksi->hki_pic1;
		}

		return (0);
	}
}

/*
 * 64 bit kstats for performance counters:
 *
 * Export 64 bit performance counters in kstats.
 *
 * If the HCA hardware supports 64 bit extended port counters, we use the
 * hardware based counters. If the HCA hardware does not support extended port
 * counters, we maintain 64 bit performance counters in software using the
 * 32 bit hardware port counters.
 *
 * The software based counters are maintained as follows:
 *
 * We create a thread that, every one second, reads the values of 32 bit
 * hardware counters and adds them to the 64 bit software counters. Immediately
 * after reading, it resets the 32 bit hardware counters to zero (so that they
 * start counting from zero again). At any time the current value of a counter
 * is going to be the sum of the 64 bit software counter and the 32 bit
 * hardware counter.
 *
 * Since this work need not be done if there is no consumer, by default
 * we do not maintain 64 bit software counters. To enable this the consumer
 * needs to write a non-zero value to the "enable" component of the of
 * perf_counters kstat. Writing zero to this component will disable this work.
 * NOTE: The enabling or disabling applies to software based counters only.
 * Hardware based counters counters are always enabled.
 *
 * If performance monitor is enabled in subnet manager, the SM could
 * periodically reset the hardware counters by sending perf-MADs. So only
 * one of either our software 64 bit counters or the SM performance monitor
 * could be enabled at the same time. However, if both of them are enabled at
 * the same time we still do our best by keeping track of the values of the
 * last read 32 bit hardware counters. If the current read of a 32 bit hardware
 * counter is less than the last read of the counter, we ignore the current
 * value and go with the last read value.
 */

/*
 * mcxnex_kstat_perfcntr64_create()
 *    Context: Only called from attach() path context
 *
 * Create "port#/perf_counters" kstat for the specified port number.
 */
void
mcxnex_kstat_perfcntr64_create(mcxnex_state_t *state, uint_t port_num)
{
	mcxnex_ks_info_t	*ksi = state->hs_ks_info;
	struct kstat		*cntr_ksp;
	struct kstat_named	*cntr_named_data;
	int			drv_instance;
	char			*drv_name;
	char			kname[32];
	int			status, ext_width_supported;

	ASSERT(port_num != 0);

	status = mcxnex_is_ext_port_counters_supported(state, port_num,
	    DDI_NOSLEEP, &ext_width_supported);
	if (status == MCXNEX_CMD_SUCCESS) {
		ksi->hki_perfcntr64[port_num - 1].
		    hki64_ext_port_counters_supported = ext_width_supported;
	}

	drv_name = (char *)ddi_driver_name(state->hs_dip);
	drv_instance = ddi_get_instance(state->hs_dip);
	(void) snprintf(kname, sizeof (kname), "port%u/perf_counters",
	    port_num);
	cntr_ksp = kstat_create(drv_name, drv_instance, kname, "ib",
	    KSTAT_TYPE_NAMED, MCXNEX_PERFCNTR64_NUM_COUNTERS,
	    KSTAT_FLAG_WRITABLE);
	if (cntr_ksp == NULL) {
		return;
	}
	cntr_named_data = (struct kstat_named *)(cntr_ksp->ks_data);

	kstat_named_init(&cntr_named_data[MCXNEX_PERFCNTR64_ENABLE_IDX],
	    "enable", KSTAT_DATA_UINT32);
	kstat_named_init(&cntr_named_data[MCXNEX_PERFCNTR64_XMIT_DATA_IDX],
	    "xmit_data", KSTAT_DATA_UINT64);
	kstat_named_init(&cntr_named_data[MCXNEX_PERFCNTR64_RECV_DATA_IDX],
	    "recv_data", KSTAT_DATA_UINT64);
	kstat_named_init(&cntr_named_data[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX],
	    "xmit_pkts", KSTAT_DATA_UINT64);
	kstat_named_init(&cntr_named_data[MCXNEX_PERFCNTR64_RECV_PKTS_IDX],
	    "recv_pkts", KSTAT_DATA_UINT64);

	ksi->hki_perfcntr64[port_num - 1].hki64_ksp = cntr_ksp;
	ksi->hki_perfcntr64[port_num - 1].hki64_port_num = port_num;
	ksi->hki_perfcntr64[port_num - 1].hki64_state = state;

	cntr_ksp->ks_private = &ksi->hki_perfcntr64[port_num - 1];
	cntr_ksp->ks_update  = mcxnex_kstat_perfcntr64_update;

	/* Install the kstat */
	kstat_install(cntr_ksp);
}

/*
 * mcxnex_kstat_perfcntr64_read()
 *
 * Read the values of 32 bit hardware counters.
 *
 * If reset is true, reset the 32 bit hardware counters. Add the values of the
 * 32 bit hardware counters to the 64 bit software counters.
 *
 * If reset is false, just save the values read from the 32 bit hardware
 * counters in hki64_last_read[].
 *
 * See the general comment on the 64 bit performance counters
 * regarding the use of last read 32 bit hardware counter values.
 */
static int
mcxnex_kstat_perfcntr64_read(mcxnex_state_t *state, uint_t port, int reset)
{
	mcxnex_ks_info_t	*ksi = state->hs_ks_info;
	mcxnex_perfcntr64_ks_info_t *ksi64 = &ksi->hki_perfcntr64[port - 1];
	int			status, i;
	uint32_t		tmp;
	mcxnex_hw_sm_perfcntr_t	sm_perfcntr;

