Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_stats.c
	ASSERT(MUTEX_HELD(&ksi->hki_perfcntr64_lock));
	ASSERT(port != 0);

	/* read the 32 bit hardware counters */
	status = mcxnex_getperfcntr_cmd_post(state, port,
	    DDI_NOSLEEP, &sm_perfcntr, 0);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	if (reset) {
		/* reset the hardware counters */
		status = mcxnex_getperfcntr_cmd_post(state, port,
		    DDI_NOSLEEP, NULL, 1);
		if (status != MCXNEX_CMD_SUCCESS) {
			return (status);
		}

		/*
		 * Update 64 bit software counters
		 */
		tmp = MAX(sm_perfcntr.portxmdata,
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_XMIT_DATA_IDX]);
		ksi64->hki64_counters[MCXNEX_PERFCNTR64_XMIT_DATA_IDX] += tmp;

		tmp = MAX(sm_perfcntr.portrcdata,
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_RECV_DATA_IDX]);
		ksi64->hki64_counters[MCXNEX_PERFCNTR64_RECV_DATA_IDX] += tmp;

		tmp = MAX(sm_perfcntr.portxmpkts,
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX]);
		ksi64->hki64_counters[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX] += tmp;

		tmp = MAX(sm_perfcntr.portrcpkts,
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_RECV_PKTS_IDX]);
		ksi64->hki64_counters[MCXNEX_PERFCNTR64_RECV_PKTS_IDX] += tmp;

		for (i = 0; i < MCXNEX_PERFCNTR64_NUM_COUNTERS; i++)
			ksi64->hki64_last_read[i] = 0;

	} else {
		/*
		 * Update ksi64->hki64_last_read[]
		 */
		SET_TO_MAX(
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_XMIT_DATA_IDX],
		    sm_perfcntr.portxmdata);

		SET_TO_MAX(
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_RECV_DATA_IDX],
		    sm_perfcntr.portrcdata);

		SET_TO_MAX(
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX],
		    sm_perfcntr.portxmpkts);

		SET_TO_MAX(
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_RECV_PKTS_IDX],
		    sm_perfcntr.portrcpkts);
	}

	return (MCXNEX_CMD_SUCCESS);
}

/*
 * mcxnex_kstat_perfcntr64_update_thread()
 *    Context: Entry point for a kernel thread
 *
 * Maintain 64 bit performance counters in software using the 32 bit
 * hardware counters.
 */
static void
mcxnex_kstat_perfcntr64_update_thread(void *arg)
{
	mcxnex_state_t		*state = (mcxnex_state_t *)arg;
	mcxnex_ks_info_t	*ksi = state->hs_ks_info;
	uint_t			i;
	clock_t			delta = drv_usectohz(1000000);

	mutex_enter(&ksi->hki_perfcntr64_lock);
	/*
	 * Every one second update the values 64 bit software counters
	 * for all ports. Exit if MCXNEX_PERFCNTR64_THREAD_EXIT flag is set.
	 */
	while (!(ksi->hki_perfcntr64_flags & MCXNEX_PERFCNTR64_THREAD_EXIT)) {
		for (i = 0; i < state->hs_cfg_profile->cp_num_ports; i++) {
			if (ksi->hki_perfcntr64[i].hki64_enabled) {
				(void) mcxnex_kstat_perfcntr64_read(state,
				    i + 1, 1);
			}
		}
		/* sleep for a second */
		(void) cv_reltimedwait(&ksi->hki_perfcntr64_cv,
		    &ksi->hki_perfcntr64_lock, delta, TR_CLOCK_TICK);
	}
	ksi->hki_perfcntr64_flags = 0;
	mutex_exit(&ksi->hki_perfcntr64_lock);
}

/*
 * mcxnex_kstat_perfcntr64_thread_create()
 *    Context: Called from the kstat context
 *
 * Create a thread that maintains 64 bit performance counters in software.
 */
static void
mcxnex_kstat_perfcntr64_thread_create(mcxnex_state_t *state)
{
	mcxnex_ks_info_t	*ksi = state->hs_ks_info;
	kthread_t		*thr;

	ASSERT(MUTEX_HELD(&ksi->hki_perfcntr64_lock));

	/*
	 * One thread per mcxnex instance. Don't create a thread if already
	 * created.
	 */
	if (!(ksi->hki_perfcntr64_flags & MCXNEX_PERFCNTR64_THREAD_CREATED)) {
		thr = thread_create(NULL, 0,
		    mcxnex_kstat_perfcntr64_update_thread,
		    state, 0, &p0, TS_RUN, minclsyspri);
		ksi->hki_perfcntr64_thread_id = thr->t_did;
		ksi->hki_perfcntr64_flags |= MCXNEX_PERFCNTR64_THREAD_CREATED;
	}
}

/*
 * mcxnex_kstat_perfcntr64_thread_exit()
 *    Context: Called from attach, detach or kstat context
 */
static void
mcxnex_kstat_perfcntr64_thread_exit(mcxnex_ks_info_t *ksi)
{
	kt_did_t	tid;

	ASSERT(MUTEX_HELD(&ksi->hki_perfcntr64_lock));

	if (ksi->hki_perfcntr64_flags & MCXNEX_PERFCNTR64_THREAD_CREATED) {
		/*
		 * Signal the thread to exit and wait until the thread exits.
		 */
		ksi->hki_perfcntr64_flags |= MCXNEX_PERFCNTR64_THREAD_EXIT;
		tid = ksi->hki_perfcntr64_thread_id;
		cv_signal(&ksi->hki_perfcntr64_cv);

		mutex_exit(&ksi->hki_perfcntr64_lock);
		thread_join(tid);
		mutex_enter(&ksi->hki_perfcntr64_lock);
	}
}

/*
 * mcxnex_kstat_perfcntr64_update_ext()
 *    Context: Called from the kstat context
 *
 * Update perf_counters kstats with the values of the extended port counters
 * from the hardware.
 */
static int
mcxnex_kstat_perfcntr64_update_ext(mcxnex_perfcntr64_ks_info_t *ksi64, int rw,
    struct kstat_named *data)
{
	mcxnex_hw_sm_extperfcntr_t	sm_extperfcntr;

	/*
	 * The "enable" component of the kstat is the only writable kstat.
	 * It is a no-op when the hardware supports extended port counters.
	 */
	if (rw == KSTAT_WRITE)
		return (0);

	/*
	 * Read the counters and update kstats.
	 */
	if (mcxnex_getextperfcntr_cmd_post(ksi64->hki64_state,
	    ksi64->hki64_port_num, DDI_NOSLEEP, &sm_extperfcntr) !=
	    MCXNEX_CMD_SUCCESS) {
		return (EIO);
	}

	data[MCXNEX_PERFCNTR64_ENABLE_IDX].value.ui32 = 1;

	data[MCXNEX_PERFCNTR64_XMIT_DATA_IDX].value.ui64 =
	    sm_extperfcntr.portxmdata;

	data[MCXNEX_PERFCNTR64_RECV_DATA_IDX].value.ui64 =
	    sm_extperfcntr.portrcdata;

	data[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX].value.ui64 =
	    sm_extperfcntr.portxmpkts;

	data[MCXNEX_PERFCNTR64_RECV_PKTS_IDX].value.ui64 =
	    sm_extperfcntr.portrcpkts;

	return (0);
}

/*
 * mcxnex_kstat_perfcntr64_update()
 *    Context: Called from the kstat context
 *
 * See the general comment on 64 bit kstats for performance counters:
 */
static int
mcxnex_kstat_perfcntr64_update(kstat_t *ksp, int rw)
{
	mcxnex_state_t			*state;
	struct kstat_named		*data;
	mcxnex_ks_info_t		*ksi;
	mcxnex_perfcntr64_ks_info_t	*ksi64;
	int				i, thr_exit;
	int				rv;

	ksi64	= ksp->ks_private;
	state	= ksi64->hki64_state;
	ksi	= state->hs_ks_info;
	data	= (struct kstat_named *)(ksp->ks_data);

	mutex_enter(&ksi->hki_perfcntr64_lock);

	if (ksi64->hki64_ext_port_counters_supported) {
		rv = mcxnex_kstat_perfcntr64_update_ext(ksi64, rw, data);
		mutex_exit(&ksi->hki_perfcntr64_lock);
		return (rv);
	}

