Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_stats.c
	/*
	 * 64 bit performance counters maintained by the software is not
	 * enabled by default. Enable them upon a writing a non-zero value
	 * to "enable" kstat. Disable them upon a writing zero to the
	 * "enable" kstat.
	 */
	if (rw == KSTAT_WRITE) {
		if (data[MCXNEX_PERFCNTR64_ENABLE_IDX].value.ui32) {
			if (ksi64->hki64_enabled == 0) {
				/*
				 * Reset the hardware counters to ensure that
				 * the hardware counter doesn't max out
				 * (and hence stop counting) before we get
				 * a chance to reset the counter in
				 * mcxnex_kstat_perfcntr64_update_thread.
				 */
				if (mcxnex_getperfcntr_cmd_post(state,
				    ksi64->hki64_port_num,
				    DDI_NOSLEEP, NULL, 1) !=
				    MCXNEX_CMD_SUCCESS) {
					mutex_exit(&ksi->hki_perfcntr64_lock);
					return (EIO);
				}

				/* Enable 64 bit software counters */
				ksi64->hki64_enabled = 1;
				for (i = 0;
				    i < MCXNEX_PERFCNTR64_NUM_COUNTERS; i++) {
					ksi64->hki64_counters[i] = 0;
					ksi64->hki64_last_read[i] = 0;
				}
				mcxnex_kstat_perfcntr64_thread_create(state);
			}

		} else if (ksi64->hki64_enabled) {
			/* Disable 64 bit software counters */
			ksi64->hki64_enabled = 0;
			thr_exit = 1;
			for (i = 0; i < state->hs_cfg_profile->cp_num_ports;
			    i++) {
				if (ksi->hki_perfcntr64[i].hki64_enabled) {
					thr_exit = 0;
					break;
				}
			}
			if (thr_exit)
				mcxnex_kstat_perfcntr64_thread_exit(ksi);
		}
	} else if (ksi64->hki64_enabled) {
		/*
		 * Read the counters and update kstats.
		 */
		if (mcxnex_kstat_perfcntr64_read(state, ksi64->hki64_port_num,
		    0) != MCXNEX_CMD_SUCCESS) {
			mutex_exit(&ksi->hki_perfcntr64_lock);
			return (EIO);
		}

		data[MCXNEX_PERFCNTR64_ENABLE_IDX].value.ui32 = 1;

		data[MCXNEX_PERFCNTR64_XMIT_DATA_IDX].value.ui64 =
		    ksi64->hki64_counters[MCXNEX_PERFCNTR64_XMIT_DATA_IDX] +
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_XMIT_DATA_IDX];

		data[MCXNEX_PERFCNTR64_RECV_DATA_IDX].value.ui64 =
		    ksi64->hki64_counters[MCXNEX_PERFCNTR64_RECV_DATA_IDX] +
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_RECV_DATA_IDX];

		data[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX].value.ui64 =
		    ksi64->hki64_counters[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX] +
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_XMIT_PKTS_IDX];

		data[MCXNEX_PERFCNTR64_RECV_PKTS_IDX].value.ui64 =
		    ksi64->hki64_counters[MCXNEX_PERFCNTR64_RECV_PKTS_IDX] +
		    ksi64->hki64_last_read[MCXNEX_PERFCNTR64_RECV_PKTS_IDX];

	} else {
		/* return 0 in kstats if not enabled */
		data[MCXNEX_PERFCNTR64_ENABLE_IDX].value.ui32 = 0;
		for (i = 1; i < MCXNEX_PERFCNTR64_NUM_COUNTERS; i++)
			data[i].value.ui64 = 0;
	}

	mutex_exit(&ksi->hki_perfcntr64_lock);
	return (0);
}
